/* Evolving zhangpengpeng rocflyhi@gmail.com */
/* zpp's comments format
comments  '(zhangpengpeng date)
comments  '(zhangpengpeng date place otherInfo)
*/

/* 进化 evolving
 * 好的架构是进化来的，不是设计来的。好的功能也是。
 * 以发展的角度看问题 
 * 这个划时代的创新，其实就是在不断的思索过程中的一个灵光乍现。
 */
 
//任何牛B的人物，都必须有一段苦B的经历。

/* 用户体验
 * 要让用户跟着感觉去使用，而不是需要动很多脑筋。 
 * 不要把功能一股脑儿都列出来，给用户太多的选择，要帮他们选择好。 
 * 突出重点，而不是不区分的罗列。
 */

/* 
 * 一个软件/系统，比如OS，设计架构时要做到层次化，结构化，包括微内核化。
 */

/* 彻底模块化
 * 一个服务器/客户端，可由多个进程组成，每个进程由多个动态库组成。
 * 基础动态库提供简单基本的功能，可叠加成功能复杂的功能动态库。
 * 这些动态库可根据需要供各个进程使用。
 */


